jemdiggity/vendor_nrf5_sdk/sdk/examples/ble_peripheral/ble_app_pwr_profiling/main.c
#define SPI_INSTANCE  0 /**< SPI instance index. */
static const nrf_drv_spi_t m_spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */
static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */

static uint8_t       m_tx_buf[] = {/*power up*/0x00, 0x0F, /*read*/0x00, 0x00, /*CS high delay*/0xFF, /*power down*/0x3F, 0xFF};           /**< TX buffer. */
static uint8_t       m_rx_buf[7 + 1];    /**< RX buffer. */
static const uint8_t m_length = sizeof(m_tx_buf);        /**< Transfer length. */

void spi_event_handler(nrf_drv_spi_evt_t const * p_event,
                       void *                    p_context)
{
    spi_xfer_done = true;
}

/**@brief 128-bit UUID base List. */
static const ble_uuid128_t m_base_uuid128 =
{
   {
       0x23, 0xD1, 0xBC, 0xEA, 0x5F, 0x78, 0x23, 0x15,
       0xDE, 0xEF, 0x12, 0x12, 0x00, 0x00, 0x00, 0x00
   }
};

static ble_gap_adv_params_t     m_adv_params;                                       /**< Parameters to be passed to the stack when starting advertising. */
static uint8_t                  m_char_value[APP_CFG_CHAR_LEN];                     /**< Value of the characteristic that will be sent as a notification to the central. */
static uint8_t                  m_addl_adv_manuf_data[ADV_ADDL_MANUF_DATA_LEN];     /**< Value of the additional manufacturer specific data that will be placed in air (initialized to all zeros). */
static ble_gatts_char_handles_t m_char_handles;                                     /**< Handles of local characteristic (as provided by the BLE stack).*/
static uint16_t                 m_conn_handle = BLE_CONN_HANDLE_INVALID;            /**< Handle of the current connection (as provided by the BLE stack, is BLE_CONN_HANDLE_INVALID if not in a connection).*/
static uint16_t                 m_service_handle;                                   /**< Handle of local service (as provided by the BLE stack).*/
static bool                     m_is_notifying_enabled = false;                     /**< Variable to indicate whether the notification is enabled by the peer.*/
static nrf_ble_gatt_t           m_gatt;                                             /**< GATT module instance. */

APP_TIMER_DEF(m_conn_int_timer_id);                                                 /**< Connection interval timer. */
// APP_TIMER_DEF(m_notif_timer_id);                                                    /**< Notification timer. */
APP_TIMER_DEF(m_adc_timer_id);                                                    /**< adc timer. */
const nrf_drv_timer_t TIMER_LED = NRF_DRV_TIMER_INSTANCE(2);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the Characteristic notification.
 *
 * @details Sends one characteristic value notification to peer if connected to it and the
 *          notification is enabled.
 */
static void char_notify(void)
{
    ret_code_t err_code;
    uint16_t len = APP_CFG_CHAR_LEN;

    // Send value if connected and notifying.
    if ((m_conn_handle != BLE_CONN_HANDLE_INVALID) && m_is_notifying_enabled)
    {
        ble_gatts_hvx_params_t hvx_params;

        memset(&hvx_params, 0, sizeof(hvx_params));
        len = sizeof(uint8_t);

        hvx_params.handle = m_char_handles.value_handle;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset = 0;
        hvx_params.p_len  = &len;
        hvx_params.p_data = m_char_value;

        err_code = sd_ble_gatts_hvx(m_conn_handle, &hvx_params);
        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        )
        {
            APP_ERROR_HANDLER(err_code);
        }
    }
}

static uint32_t adc_read_ticks = 0;
static uint32_t adc_read_ticks_last = 0;
static uint32_t adc_read_ticks_diff = 0;
static uint32_t jitter_bin[7] = {0,0,0,0,0,0,0};
static uint32_t counter = 0;
static uint32_t ticks_sum = 0;
static uint32_t no_jitter_counter = 0;
static bool firstTime = true;
uint32_t const k_bangon = 2926;
uint32_t const k_running_average_count = 100;
uint32_t running_average_count = 100;
uint32_t period_sum = 0;
uint32_t last_period_sum = 0;

static void read_adc(void)
{
  memset(m_rx_buf, 0, m_length);
  while (!spi_xfer_done)
  {
    // __WFE();
  }

  spi_xfer_done = false;

  adc_read_ticks = nrf_drv_timer_capture(&TIMER_LED, NRF_TIMER_CC_CHANNEL2);
  adc_read_ticks_diff = adc_read_ticks - adc_read_ticks_last;
  adc_read_ticks_last = adc_read_ticks;

  if (!firstTime) {
    ticks_sum += adc_read_ticks_diff;
    ++counter;

    period_sum += adc_read_ticks_diff;
    --running_average_count;
    if (!running_average_count) {
      running_average_count = k_running_average_count;
      last_period_sum = period_sum;
      period_sum = 0;
    }


   if (adc_read_ticks_diff <= k_bangon - 100 * k_bangon / 100)
    {
      ++jitter_bin[1];
    }
    else if (adc_read_ticks_diff <= k_bangon -  50 * k_bangon / 100)
    {
      ++jitter_bin[2];
    }
    else if (adc_read_ticks_diff <= k_bangon - 25 * k_bangon / 100)
    {
      ++jitter_bin[3];
    }
    else if (k_bangon -  25*k_bangon / 100 <= adc_read_ticks_diff && adc_read_ticks_diff <= k_bangon + 25*k_bangon / 100)
    {
      ++jitter_bin[0];
      ++no_jitter_counter;
    }
    else if (k_bangon + 100*k_bangon / 100 < adc_read_ticks_diff)
    {
      ++jitter_bin[6];
    }
    else if (k_bangon + 50*k_bangon / 100 < adc_read_ticks_diff)
    {
      ++jitter_bin[5];
    }
    else if (k_bangon + 25*k_bangon / 100 < adc_read_ticks_diff)
    {
      ++jitter_bin[4];
    }
    else
    {}
  } else {
    firstTime = false;
  }



  APP_ERROR_CHECK(nrf_drv_spi_transfer(&m_spi, m_tx_buf, m_length, m_rx_buf, m_length));
}


