jemdiggity/vendor_nrf5_sdk/sdk/examples/ble_peripheral/ble_app_pwr_profiling/main.c
    // If we reach this point, the application was woken up
    // by pressing one of the two configured buttons.
    gap_params_init();
    gatt_init();

    if (is_notification_mode)
    {
        // Notification button is pressed. Start connectable advertisement.
        connectable_adv_init();
        service_add();
    }
    else
    {
        non_connectable_adv_init();
    }

    advertising_data_init();
    advertising_start();

    // Enter main loop.
    for (;;)
    {
      NRF_LOG_INFO("[<100%]\t[ 100-50%]\t[  50-25%]\t[  +/-25%]\t[  25-50%]\t[ 50-100%]\t[   >100%]\n");
      NRF_LOG_INFO("[    ?]\t[%8u]\t[%8u]\t[%8u]\t[%8u]\t[%8u]\t[%8u]\n", /*itter_bin_1,*/ jitter_bin[2], jitter_bin[3], jitter_bin[0], jitter_bin[4], jitter_bin[5], jitter_bin[6]);
      const uint32_t total = jitter_bin[0] + jitter_bin[1] + jitter_bin[2] + jitter_bin[3] + jitter_bin[4] + jitter_bin[5] + jitter_bin[6];
      NRF_LOG_INFO("[    ?]\t[%7d%%]\t[%7d%%]\t[%7d%%]\t[%7d%%]\t[%7d%%]\t[%7d%%]\n", /*itter_bin_1,*/
        (int)(10000.0f*jitter_bin[2]/total),
        (int)(10000.0f*jitter_bin[3]/total),
        (int)(10000.0f*jitter_bin[0]/total),
        (int)(10000.0f*jitter_bin[4]/total),
        (int)(10000.0f*jitter_bin[5]/total),
        (int)(10000.0f*jitter_bin[6]/total));
      NRF_LOG_INFO("Avg period %u ticks %u us, average %u ticks over last %u samples\n", (uint32_t)(ticks_sum/counter), (uint32_t)(ticks_sum/counter/16), (int32_t)(1.0f*last_period_sum/k_running_average_count), k_running_average_count);
      nrf_delay_ms(1000);
      // power_manage();
    }
}

/**
 * @}
 */
